<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"test-apply apply_apply_error","backend":"18f44efefb19591ab58bbf22926442593271ae9ec5aa5e43f6ddd641179be50c","plan_job_ref":"Job Test terraform-apply #791 at https://github.com/dflook/terraform-github-actions/actions/runs/22520633209","plan_out_hash":"0944570f6e9bac5ea7852906d500d4d82d2f499ea4ad43aa81a50bab9fadbaf5","plan_hash":"3cac2efa577a6815ffe981016f4a0b31fe492e8748d6d1d91fbb92859161221f","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan for __test-apply apply_apply_error__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.my_bucket will be created
+   resource "aws_s3_bucket" "my_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "hello"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "eu-west-2"
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Test terraform-apply #791](https://github.com/dflook/terraform-github-actions/actions/runs/22520633209)